micropython/micropython/ports/stm32/timer.c
    if (args[ARG_freq].u_obj != mp_const_none) {
        // set prescaler and period from desired frequency
        init->Prescaler = compute_prescaler_period_from_freq(self, args[ARG_freq].u_obj, &init->Period);
    } else if (args[ARG_prescaler].u_int != 0xffffffff && args[ARG_period].u_int != 0xffffffff) {
        // set prescaler and period directly
        init->Prescaler = args[ARG_prescaler].u_int;
        init->Period = args[ARG_period].u_int;
    } else {
        mp_raise_TypeError("must specify either freq, or prescaler and period");
    }

    init->CounterMode = args[ARG_mode].u_int;
    if (!IS_TIM_COUNTER_MODE(init->CounterMode)) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError, "invalid mode (%d)", init->CounterMode));
    }

    init->ClockDivision = args[ARG_div].u_int == 2 ? TIM_CLOCKDIVISION_DIV2 :
                          args[ARG_div].u_int == 4 ? TIM_CLOCKDIVISION_DIV4 :
                                                     TIM_CLOCKDIVISION_DIV1;

    init->RepetitionCounter = 0;

    // enable TIM clock
    switch (self->tim_id) {
        case 1: __HAL_RCC_TIM1_CLK_ENABLE(); break;
        case 2: __HAL_RCC_TIM2_CLK_ENABLE(); break;
        case 3: __HAL_RCC_TIM3_CLK_ENABLE(); break;
        #if defined(TIM4)
        case 4: __HAL_RCC_TIM4_CLK_ENABLE(); break;
        #endif
        #if defined(TIM5)
        case 5: __HAL_RCC_TIM5_CLK_ENABLE(); break;
        #endif
        #if defined(TIM6)
        case 6: __HAL_RCC_TIM6_CLK_ENABLE(); break;
        #endif
        #if defined(TIM7)
        case 7: __HAL_RCC_TIM7_CLK_ENABLE(); break;
        #endif
        #if defined(TIM8)
        case 8: __HAL_RCC_TIM8_CLK_ENABLE(); break;
        #endif
        #if defined(TIM9)
        case 9: __HAL_RCC_TIM9_CLK_ENABLE(); break;
        #endif
        #if defined(TIM10)
        case 10: __HAL_RCC_TIM10_CLK_ENABLE(); break;
        #endif
        #if defined(TIM11)
        case 11: __HAL_RCC_TIM11_CLK_ENABLE(); break;
        #endif
        #if defined(TIM12)
        case 12: __HAL_RCC_TIM12_CLK_ENABLE(); break;
        #endif
        #if defined(TIM13)
        case 13: __HAL_RCC_TIM13_CLK_ENABLE(); break;
        #endif
        #if defined(TIM14)
        case 14: __HAL_RCC_TIM14_CLK_ENABLE(); break;
        #endif
        #if defined(TIM15)
        case 15: __HAL_RCC_TIM15_CLK_ENABLE(); break;
        #endif
        #if defined(TIM16)
        case 16: __HAL_RCC_TIM16_CLK_ENABLE(); break;
        #endif
        #if defined(TIM17)
        case 17: __HAL_RCC_TIM17_CLK_ENABLE(); break;
        #endif
    }

    // set IRQ priority (if not a special timer)
    if (self->tim_id != 5) {
        NVIC_SetPriority(IRQn_NONNEG(self->irqn), IRQ_PRI_TIMX);
        if (self->tim_id == 1) {
            NVIC_SetPriority(TIM1_CC_IRQn, IRQ_PRI_TIMX);
        #if defined(TIM8)
        } else if (self->tim_id == 8) {
            NVIC_SetPriority(TIM8_CC_IRQn, IRQ_PRI_TIMX);
        #endif
        }
    }

    // init TIM
    HAL_TIM_Base_Init(&self->tim);
    #if defined(IS_TIM_ADVANCED_INSTANCE)
    if (IS_TIM_ADVANCED_INSTANCE(self->tim.Instance)) {
    #elif defined(IS_TIM_BREAK_INSTANCE)
    if (IS_TIM_BREAK_INSTANCE(self->tim.Instance)) {
    #else
    if (0) {
    #endif
        config_deadtime(self, args[ARG_deadtime].u_int);
    }

    // Enable ARPE so that the auto-reload register is buffered.
    // This allows to smoothly change the frequency of the timer.
    self->tim.Instance->CR1 |= TIM_CR1_ARPE;

    // Start the timer running
    if (args[ARG_callback].u_obj == mp_const_none) {
        HAL_TIM_Base_Start(&self->tim);
    } else {
        pyb_timer_callback(MP_OBJ_FROM_PTR(self), args[ARG_callback].u_obj);
    }

    return mp_const_none;
}

// This table encodes the timer instance and irq number (for the update irq).
// It assumes that timer instance pointer has the lower 8 bits cleared.
#define TIM_ENTRY(id, irq) [id - 1] = (uint32_t)TIM##id | irq
STATIC const uint32_t tim_instance_table[MICROPY_HW_MAX_TIMER] = {
    #if defined(STM32F0)
    TIM_ENTRY(1, TIM1_BRK_UP_TRG_COM_IRQn),
    #elif defined(STM32F4) || defined(STM32F7)
    TIM_ENTRY(1, TIM1_UP_TIM10_IRQn),
    #elif defined(STM32L4)
    TIM_ENTRY(1, TIM1_UP_TIM16_IRQn),
    #endif
    TIM_ENTRY(2, TIM2_IRQn),
    TIM_ENTRY(3, TIM3_IRQn),
    #if defined(TIM4)
    TIM_ENTRY(4, TIM4_IRQn),
    #endif
    #if defined(TIM5)
    TIM_ENTRY(5, TIM5_IRQn),
    #endif
    #if defined(TIM6)
    TIM_ENTRY(6, TIM6_DAC_IRQn),
    #endif
    #if defined(TIM7)
    TIM_ENTRY(7, TIM7_IRQn),
    #endif
    #if defined(TIM8)
    #if defined(STM32F4) || defined(STM32F7)
    TIM_ENTRY(8, TIM8_UP_TIM13_IRQn),
    #elif defined(STM32L4)
    TIM_ENTRY(8, TIM8_UP_IRQn),
    #endif
    #endif
    #if defined(TIM9)
    TIM_ENTRY(9, TIM1_BRK_TIM9_IRQn),
    #endif
    #if defined(TIM10)
    TIM_ENTRY(10, TIM1_UP_TIM10_IRQn),
    #endif
    #if defined(TIM11)
    TIM_ENTRY(11, TIM1_TRG_COM_TIM11_IRQn),
    #endif
    #if defined(TIM12)
    TIM_ENTRY(12, TIM8_BRK_TIM12_IRQn),
    #endif
    #if defined(TIM13)
    TIM_ENTRY(13, TIM8_UP_TIM13_IRQn),
    #endif
    #if defined(STM32F0)
    TIM_ENTRY(14, TIM14_IRQn),
    #elif defined(TIM14)
    TIM_ENTRY(14, TIM8_TRG_COM_TIM14_IRQn),
    #endif
    #if defined(TIM15)
    #if defined(STM32F0) || defined(STM32H7)
    TIM_ENTRY(15, TIM15_IRQn),
    #else
    TIM_ENTRY(15, TIM1_BRK_TIM15_IRQn),
    #endif
    #endif
    #if defined(TIM16)
    #if defined(STM32F0) || defined(STM32H7)
    TIM_ENTRY(16, TIM16_IRQn),
    #else
    TIM_ENTRY(16, TIM1_UP_TIM16_IRQn),
    #endif
    #endif
    #if defined(TIM17)
    #if defined(STM32F0) || defined(STM32H7)
    TIM_ENTRY(17, TIM17_IRQn),
    #else
    TIM_ENTRY(17, TIM1_TRG_COM_TIM17_IRQn),
    #endif
    #endif
};
#undef TIM_ENTRY

/// \classmethod \constructor(id, ...)
/// Construct a new timer object of the given id.  If additional
/// arguments are given, then the timer is initialised by `init(...)`.
/// `id` can be 1 to 14, excluding 3.
STATIC mp_obj_t pyb_timer_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // check arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    // get the timer id
    mp_int_t tim_id = mp_obj_get_int(args[0]);

